In [ ]:
# ЗАДАНИЕ 1
# Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
# Определите какому фильму было выставлено больше всего оценок 5.0.

In [5]:
import pandas as pd

In [ ]:
#  - отсортировать все фильмы с рейтингом 5.0
# - соединиить с df movies по movieId, чтобы получить название фильмов
# - посчитать кол-во

In [6]:
ratings = pd.read_csv('ratings.csv')
ratings.head(3)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224

In [7]:
movies = pd.read_csv('movies.csv')
movies.head(3)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance

In [8]:
joined = ratings.merge(movies, on='movieId', how='inner').query('rating == 5')
joined.head() # джоиним два df, отфильтровываем фильмы с рейтингом 5.0

,userId,movieId,rating,timestamp,title,genres
9,31,1,5.0,850466616,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
12,40,1,5.0,832058959,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
13,43,1,5.0,848993983,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
16,46,1,5.0,834787906,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
19,57,1,5.0,965796031,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [9]:
joined[['movieId', 'rating', 'title']].groupby('title')['rating'].count().head(1) # оставляем нужные столбцы, 
# группируем по названию и выводим фильм, которому поставил наибольшее кол-во оценки 5.0

title
'Salem's Lot (2004)    1
Name: rating, dtype: int64

In [ ]:
# ЗАДАНИЕ 2
# По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония)
# категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [11]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [12]:
baltic = data[ (data['country']=='Latvia') | (data['country']=='Lithuania') | (data['country']=='Estonia') ]
baltic.sample(3) #  отсортировать страны: Латвия, Литва, Эстония (случайный порядок)

         country  year  quantity  category
784862   Estonia  2006     420.0        42
1043354  Estonia  1994     188.0        67
624913   Estonia  1994       7.0        37

In [13]:
baltic = baltic[ (baltic['category']==4) | (baltic['category']==12) | (baltic['category']==21) ]
baltic.sample(4)# отсортировать категории: 4, 12, 21

          country  year  quantity  category
116905  Lithuania  2000       1.0        12
232017    Estonia  2003    2410.0        21
237504    Estonia  2008       5.0        21
217833  Lithuania  1994    2730.0        21

In [14]:
baltic = baltic[baltic['year'].between(2005, 2010)]
baltic.sample(5) # за период с 2005 по 2010 года

          country  year  quantity  category
215663     Latvia  2006    1531.0        21
113242  Lithuania  2006       3.0        12
253981  Lithuania  2010     133.0        21
11157   Lithuania  2007       0.0         4
104434  Lithuania  2007       2.0        12

In [15]:
baltic['quantity'].sum() # посчитать суммарное потребление

240481.0

In [16]:
df = pd.read_html('https://fortrader.org/en/forex-education')[0]

In [ ]:
# Задание 3
# Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [17]:
df[:7]

,Сайт,Описание,Описание.1,Загрузок
0,forexsystemsru.com,Очень интересно,Очень интересно,284/12
1,forexsystems.ru,Независимый форекс форум для трейдеров,Независимый форекс форум для трейдеров,650/2
2,fortrader.ru,Форекс журнал для трейдеров - все о форекс,Форекс журнал для трейдеров - все о форекс,284/12
3,financeforum.ru,Все о финансах на одной странице,Все о финансах на одной странице,20/0
4,tvojforex.ru,Форекс блог о заработке на форекс,Форекс блог о заработке на форекс,37/0
5,forexmytop.ru,Независимый рейтинг Форекс брокеров »,Независимый рейтинг Форекс брокеров »,10/0
6,ubk-forex.blogspot.com,Блог Инвестора: ШОК-КОУЧИНГ,Блог Инвестора: ШОК-КОУЧИНГ,14/0